ПосуточнаяАрендаКвартир/src/Catalogs/ОбъектыАренды/ОбъектыАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыАренды</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомнат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСпальныхМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаСутки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПосуточнаяАрендаКвартир/src/InformationRegisters/ЦеныАренды/ЦеныАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныАренды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЦенаЗаСутки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектАренды</name>
    <type>
      <types>CatalogRef.ОбъектыАренды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПосуточнаяАрендаКвартир/src/Catalogs/ОбъектыАренды/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПриЗаписи(Отказ)
	

    // 1. Ничего не делаем во время обмена данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    // 2. Если цена не заполнена – историю не пишем
	Если Не ЗначениеЗаполнено(ЦенаЗаСутки) Тогда
		Возврат;
	КонецЕсли;

    // 3. Создаём набор записей регистра сведений ЦеныАренды
	Набор = РегистрыСведений.ЦеныАренды.СоздатьНаборЗаписей();

    // 4. Добавляем новую строку истории
	Запись = Набор.Добавить();
	Запись.Период = ТекущаяДатаСеанса(); // дата начала действия новой цены
	Запись.ОбъектАренды = Ссылка; // этот объект аренды
	Запись.ЦенаЗаСутки  = ЦенаЗаСутки;

    // 5. Сохраняем набор
	Набор.Записать();

КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
